#线性
	一对一，即除了第一个和最后一个数据元素之外，其它数据元素都是	首尾相接的
	比如：一群人排队，一号走了，二号就变一号，三号变二号的关系
	每走一个人他的位置都会有一个人来顶替
	
	A[0],A[2],......A[i+1].....A[n]
	
A[i] :里面的i是元素的序号、坐标

#树形图
	树形结构指的是数据元素之间存在着“一对多”的树形关系的数据结	构，是一类重要的非线性数据结构。
	比如：广西是树根，对应的南宁、柳州、桂林是它的分支，是树枝。
		
				/  柳州（树枝）

广西 （树根）     	---	南宁（树枝）

				\  桂林（树枝）


#队列：
	是一种先进先出的数据结构
	比如：比如平时排队，先排的人先到他。也就是：先进先出。从一	端	放入元素的操作称为入队，取出元素为出队

一号  <-- 二号  <--三号

#栈元素：
	先进后出，顺序存储结构，它是一种运算受限的线性表。限定仅在表尾进行插入和删除操作的线性表
	比如：放一堆盘子，先放的就会在底部，最先放的盘子最后才能拿，	最后放的，最先拿。
				
			
#图形结构：
	在数据的逻辑结构D=（KR）中，如果K中结点对于关系R的前趋和后	继的个数不加限制，即仅含一种任意的关系，则称这种数据结构为图	形结构 
	比如：圆桌上大家吃饭就餐，每个人和每盘菜的关系













